online_benchmark_log/unknown/DeepSeek-R1-MXFP4-Preview/v0.5.5-rocm700-mi35x-20251107_DeepSeek-R1-MXFP4-Preview_FP8_online/sglang_serving_benchmark_concurrency_64_run1_20251107_172455.log
Run started at: 2025-11-07 17:24:55 PST
Using 500 prompts for concurrency 64
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='random', dataset_path='', model=None, served_model_name=None, tokenizer=None, num_prompts=500, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=3200, random_output_len=800, random_range_ratio=1.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=64, output_file=None, output_details=False, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, profile_activities=['CPU', 'GPU'], lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='random', dataset_path='', model='/mnt/raid/models/deepseek-ai/amd-DeepSeek-R1-MXFP4-Preview', served_model_name=None, tokenizer=None, num_prompts=500, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=3200, random_output_len=800, random_range_ratio=1.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=64, output_file=None, output_details=False, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, profile_activities=['CPU', 'GPU'], lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)

#Input tokens: 1600000
#Output tokens: 400000
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 500/500 [06:46<00:00,  1.23it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 64        
Successful requests:                     500       
Benchmark duration (s):                  406.84    
Total input tokens:                      1600000   
Total input text tokens:                 1600000   
Total input vision tokens:               0         
Total generated tokens:                  400000    
Total generated tokens (retokenized):    398269    
Request throughput (req/s):              1.23      
Input token throughput (tok/s):          3932.78   
Output token throughput (tok/s):         983.20    
Total token throughput (tok/s):          4915.98   
Concurrency:                             62.42     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   50789.09  
Median E2E Latency (ms):                 50082.24  
---------------Time to First Token----------------
Mean TTFT (ms):                          1122.63   
Median TTFT (ms):                        1117.44   
P99 TTFT (ms):                           1861.36   
---------------Inter-Token Latency----------------
Mean ITL (ms):                           62.16     
Median ITL (ms):                         52.82     
P95 ITL (ms):                            112.61    
P99 ITL (ms):                            257.47    
Max ITL (ms):                            1619.94   
==================================================
Run completed at: 2025-11-07 17:31:53 PST
Run duration: 418 seconds